In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [["John",	2017,		"Computer",	15000.00],
        ["Ravi",	2017,		"Mobile",	20000.00],
        ["John",	2018,		"Computer",	10000.00],
        ["Ravi",	2019,		"Mobile",	25000.00],
        ["Ravi",	2018,		"Calculator",	1500.00],
        ["Shafi",	2017,		"Laptop",	10000.00],
        ["Shafi",	2018,		"Laptop",	15000.00],
        ["John",	2019,		"TV",	20000.00],
        ["Shafi",	2019,	"TV",20000.00]
]
cols=["employee",	"year",	"product",	"sales"]

In [3]:
df=pd.DataFrame(data,columns=cols)
df1=df.copy()
df2=df.copy()

In [4]:
df

  employee  year     product    sales
0     John  2017    Computer  15000.0
1     Ravi  2017      Mobile  20000.0
2     John  2018    Computer  10000.0
3     Ravi  2019      Mobile  25000.0
4     Ravi  2018  Calculator   1500.0
5    Shafi  2017      Laptop  10000.0
6    Shafi  2018      Laptop  15000.0
7     John  2019          TV  20000.0
8    Shafi  2019          TV  20000.0

# ROW_NUMBER

```
SELECT *, 
      ROW_NUMBER() over(partition by employee order by year desc) as row_num
FROM window_functions
ORDER BY employee 
```

In [5]:
df['row_num']=df.sort_values(by=['year'],ascending=False).groupby(['employee']).cumcount()+1
df.sort_values(by='employee')

  employee  year     product    sales  row_num
0     John  2017    Computer  15000.0        3
2     John  2018    Computer  10000.0        2
7     John  2019          TV  20000.0        1
1     Ravi  2017      Mobile  20000.0        3
3     Ravi  2019      Mobile  25000.0        1
4     Ravi  2018  Calculator   1500.0        2
5    Shafi  2017      Laptop  10000.0        3
6    Shafi  2018      Laptop  15000.0        2
8    Shafi  2019          TV  20000.0        1

```
SELECT *, 
      ROW_NUMBER() over(partition by product order by year desc) as row_num
FROM window_functions
ORDER BY product 
```

In [6]:
df['row_num']=df.sort_values(by=['year'],ascending=False).groupby(['product']).cumcount()+1
df.sort_values(by='product')

  employee  year     product    sales  row_num
4     Ravi  2018  Calculator   1500.0        1
0     John  2017    Computer  15000.0        2
2     John  2018    Computer  10000.0        1
5    Shafi  2017      Laptop  10000.0        2
6    Shafi  2018      Laptop  15000.0        1
1     Ravi  2017      Mobile  20000.0        2
3     Ravi  2019      Mobile  25000.0        1
7     John  2019          TV  20000.0        1
8    Shafi  2019          TV  20000.0        2

```
SELECT *, 
      ROW_NUMBER() over(partition by employee, product order by sales desc) as row_num
FROM window_functions
ORDER BY product 
```

In [7]:
df['row_num']=df.sort_values(by=['sales'],ascending=False).groupby(['employee','product']).cumcount()+1
df.sort_values(by='product')

  employee  year     product    sales  row_num
4     Ravi  2018  Calculator   1500.0        1
0     John  2017    Computer  15000.0        1
2     John  2018    Computer  10000.0        2
5    Shafi  2017      Laptop  10000.0        2
6    Shafi  2018      Laptop  15000.0        1
1     Ravi  2017      Mobile  20000.0        2
3     Ravi  2019      Mobile  25000.0        1
7     John  2019          TV  20000.0        1
8    Shafi  2019          TV  20000.0        1

#### Below and Above gives the same result

In [8]:
df['row_num']=df.sort_values(by=['sales'],ascending=False).groupby(['product','employee']).cumcount()+1
df.sort_values(by='product')

  employee  year     product    sales  row_num
4     Ravi  2018  Calculator   1500.0        1
0     John  2017    Computer  15000.0        1
2     John  2018    Computer  10000.0        2
5    Shafi  2017      Laptop  10000.0        2
6    Shafi  2018      Laptop  15000.0        1
1     Ravi  2017      Mobile  20000.0        2
3     Ravi  2019      Mobile  25000.0        1
7     John  2019          TV  20000.0        1
8    Shafi  2019          TV  20000.0        1

# ngroup() - Maps a single number to each category provided in groupby

In [9]:
df1['ngroup_by_product']=df1.groupby(['product']).ngroup()+1
df1

  employee  year     product    sales  ngroup_by_product
0     John  2017    Computer  15000.0                  2
1     Ravi  2017      Mobile  20000.0                  4
2     John  2018    Computer  10000.0                  2
3     Ravi  2019      Mobile  25000.0                  4
4     Ravi  2018  Calculator   1500.0                  1
5    Shafi  2017      Laptop  10000.0                  3
6    Shafi  2018      Laptop  15000.0                  3
7     John  2019          TV  20000.0                  5
8    Shafi  2019          TV  20000.0                  5

In [10]:
df1['ngroup_by_product_employee']=df1.groupby(['product','employee']).ngroup()+1
df1

,employee,year,product,sales,ngroup_by_product,ngroup_by_product_employee
0,John,2017,Computer,15000.0,2,2
1,Ravi,2017,Mobile,20000.0,4,4
2,John,2018,Computer,10000.0,2,2
3,Ravi,2019,Mobile,25000.0,4,4
4,Ravi,2018,Calculator,1500.0,1,1
5,Shafi,2017,Laptop,10000.0,3,3
6,Shafi,2018,Laptop,15000.0,3,3
7,John,2019,TV,20000.0,5,5
8,Shafi,2019,TV,20000.0,5,6

# RANK

```
SELECT *, 
      RANK() over(partition by  employee order by sales desc) as rank
FROM window_functions
ORDER BY product 
;
```

In [11]:
df2['rank']=df2.groupby(['employee'])['sales'].rank(method='first',ascending=False).astype(int)
df2.sort_values(by=['employee'],ascending=[True])

  employee  year     product    sales  rank
0     John  2017    Computer  15000.0     2
2     John  2018    Computer  10000.0     3
7     John  2019          TV  20000.0     1
1     Ravi  2017      Mobile  20000.0     2
3     Ravi  2019      Mobile  25000.0     1
4     Ravi  2018  Calculator   1500.0     3
5    Shafi  2017      Laptop  10000.0     3
6    Shafi  2018      Laptop  15000.0     2
8    Shafi  2019          TV  20000.0     1

```
SELECT *, 
      RANK() over(partition by product, employee order by sales asc) as row_num
FROM window_functions
ORDER BY product 
;
```

In [12]:
df2['rank']=df2.groupby(['employee','product'])['sales'].rank(method='first',ascending=True).astype(int)
df2.sort_values(by=['employee'],ascending=[True])

  employee  year     product    sales  rank
0     John  2017    Computer  15000.0     2
2     John  2018    Computer  10000.0     1
7     John  2019          TV  20000.0     1
1     Ravi  2017      Mobile  20000.0     1
3     Ravi  2019      Mobile  25000.0     2
4     Ravi  2018  Calculator   1500.0     1
5    Shafi  2017      Laptop  10000.0     1
6    Shafi  2018      Laptop  15000.0     2
8    Shafi  2019          TV  20000.0     1

# DENSE_RANK

```
SELECT *, 
      DENSE_RANK() over(partition by product order by sales desc) as row_num
FROM window_functions
ORDER BY employee,year 
;
```

In [13]:
df2['denserank']=df2.groupby(['product'])['sales'].rank(method='dense',ascending=False).astype(int)
df2.sort_values(by=['product','sales'],ascending=[True,True])

  employee  year     product    sales  rank  denserank
4     Ravi  2018  Calculator   1500.0     1          1
2     John  2018    Computer  10000.0     1          2
0     John  2017    Computer  15000.0     2          1
5    Shafi  2017      Laptop  10000.0     1          2
6    Shafi  2018      Laptop  15000.0     2          1
1     Ravi  2017      Mobile  20000.0     1          2
3     Ravi  2019      Mobile  25000.0     2          1
7     John  2019          TV  20000.0     1          1
8    Shafi  2019          TV  20000.0     1          1

```
SELECT *, 
      DENSE_RANK() over(partition by product order by sales asc) as row_num
FROM window_functions
ORDER BY employee,year 
;
```

In [14]:
df2['denserank']=df2.groupby(['product'])['sales'].rank(method='dense',ascending=True).astype(int)
df2.sort_values(by=['product','sales'],ascending=[True,True])

  employee  year     product    sales  rank  denserank
4     Ravi  2018  Calculator   1500.0     1          1
2     John  2018    Computer  10000.0     1          1
0     John  2017    Computer  15000.0     2          2
5    Shafi  2017      Laptop  10000.0     1          1
6    Shafi  2018      Laptop  15000.0     2          2
1     Ravi  2017      Mobile  20000.0     1          1
3     Ravi  2019      Mobile  25000.0     2          2
7     John  2019          TV  20000.0     1          1
8    Shafi  2019          TV  20000.0     1          1